other_files/OpenFOAM_Sample_Files/study_room/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.4;
	format		ascii;
	class		dictionary;
	location	"system";
	object		controlDict;
}

application		simpleFoam;

startFrom		latestTime;

startTime		0;

stopAt		endTime;

endTime		1000;

deltaT		1;

writeControl		timeStep;

writeInterval		100;

purgeWrite		0;

writeFormat		ascii;

writePrecision		6;

writeCompression		off;

timeFormat		general;

timePrecision		6;

runTimeModifiable		true;