other_files/OpenFOAM_Sample_Files/study_room/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.4;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		blockMeshDict;
}

convertToMeters 1;

vertices
(
(10.0 0.0 10.0)
(0.0 0.0 10.0)
(10.0 10.0 0.0)
(0.0 10.0 0.0)
(10.0 0.0 0.0)
(0.0 10.0 10.0)
(10.0 10.0 10.0)
(0.0 0.0 0.0)
);

blocks
(
   hex (7 4 2 3 1 0 6 5) (1 1 1) simpleGrading (1.0 1.0 1.0)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (
            (7 4 0 1)
            (4 2 6 0)
            (2 3 5 6)
            (3 7 1 5)
            (4 7 3 2)
            (1 0 6 5)
       );
   }
);

mergePatchPair
(
);
