other_files/OpenFOAM_Sample_Files/study_room/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.4;
	format		ascii;
	class		dictionary;
	location	"system";
	object		snappyHexMeshDict;
}

castellatedMesh		true;

snap		true;

addLayers		false;

geometry
{

    study_room.stl
    {

        type		triSurfaceMesh;

        name		study_room;

        regions
        {

            west_window
            {

                name		west_window;

            }

            room
            {

                name		room;

            }

            east_window
            {

                name		east_window;

            }

        }

    }

}

castellatedMeshControls
{

    maxLocalCells		50000;

    maxGlobalCells		200000;

    minRefinementCells		10;

    maxLoadUnbalance		0.10;

    nCellsBetweenLevels		1;

    features		();

    refinementSurfaces
    {

        study_room
        {

            level		(1 2);

            regions
            {

                west_window
                {

                    level		(10 10);

                }

                room
                {

                    level		(5 5);

                }

                east_window
                {

                    level		(10 10);

                }

            }

        }

    }

    resolveFeatureAngle		30;

    refinementRegions{}

    locationInMesh		(5.0 5.0 5.0);

    allowFreeStandingZoneFaces		false;

}

snapControls
{

    nSmoothPatch		3;

    tolerance		1;

    nSolveIter		300;

    nRelaxIter		5;

    implicitFeatureSnap		true;

    multiRegionFeatureSnap		true;

}

addLayersControls
{

    relativeSizes		true;

    layers{}

    expansionRatio		1.0;

    finalLayerThickness		0.3;

    minThickness		0.2;

    nGrow		0;

    featureAngle		60;

    nRelaxIter		5;

    nSmoothSurfaceNormals		1;

    nSmoothThickness		10;

    nSmoothNormals		3;

    maxFaceThicknessRatio		0.5;

    maxThicknessToMedialRatio		0.3;

    minMedianAxisAngle		130;

    nBufferCellsNoExtrude		0;

    nLayerIter		50;

    nRelaxedIter		20;

}

meshQualityControls
{

    maxNonOrtho		60;

    maxBoundarySkewness		20;

    maxInternalSkewness		4;

    maxConcave		80;

    minFlatness		0.5;

    minVol		1e-13;

    minTetQuality		1e-15;

    minArea		-1;

    minTwist		0.02;

    minDeterminant		0.001;

    minFaceWeight		0.02;

    minVolRatio		0.01;

    minTriangleTwist		-1;

    nSmoothScale		4;

    errorReduction		0.75;

}

debug		0;

mergeTolerance		1E-6;